trade_exp/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Пользователи</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="d7cfc87f-ac09-44aa-91d9-6511c408c5cb">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cc8e3172-491d-45d8-a7eb-fc6c400845cb">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ae6d0e12-8857-476c-b4b2-f03295cbed3e">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="d6969c1e-e13c-4542-abb7-9cf6bb50b8e2">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="bbbfb817-8db3-4415-86c3-af028276d6e9">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="aa7d5ca4-3c02-4ca1-a790-2435ee9f9f02">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Сотрудники</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="b57ce5b7-9e28-4f84-a668-467a507068c3">
    <name>Должность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="613a9982-ea2e-40bd-b0e1-5642e976be87">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c97fb60c-ec2d-420a-93a9-39602a2bbfdf">
    <name>Уволен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="18560314-7951-472c-8aac-2a5b52d0acfe">
    <name>Отдел</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf0376ac-0d78-4ccb-88b0-6fb290797677">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aa27d4c3-5c6c-4d49-bc20-f0d9faedd48f">
    <name>РольОПШ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f20e46f-464f-4f7c-85f2-c2ceb761c7ca">
    <name>ДатаУвольнения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ea584be0-70fa-40c6-9056-0ac6d48f5544">
    <name>ДатаПриема</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="93190e85-82b5-4f8d-86d4-60a3ed158497">
    <name>ИзменятьТребуетПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ae0a6a00-9b29-4553-88a2-43a85bee5a3a">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2c716114-b753-459f-820d-3eefc10412b6">
    <name>ИдентификаторМобильногоПриложения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0e3a882-dc26-453d-ae18-394afecbe606">
    <name>ЦельПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e140be66-a953-4235-9404-eb1e4326c329">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e204e166-c00a-4107-b2f6-e178a0260ea2">
    <name>ПотребностьВСлужебномТранспорте</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8e321359-c912-4451-9965-e660dd87561c">
    <name>ВГрафике</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="75ed98aa-60db-49f8-9e60-419549eea6b0">
    <name>Касса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="81ba44aa-675f-4a78-bd9e-bd949a5d139f">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3c56826a-54b5-44f6-b674-4f57e9006ae4">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c365c143-4ee2-4da0-840a-f5707c956f21">
    <name>ИзменятьЦель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1bad7ab2-c198-4c43-a6cd-a4c4dcb497cf">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="824f90f8-db60-4eee-ae25-c8da8bd31141">
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="46ca7a78-d4ae-44ee-8d05-a15add9f79c4">
    <name>ПутьДляФотоСТСД</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7b035ccb-950d-48ec-ba42-fbcf94fe0d51">
    <name>УстанавливатьПериодНеПозднее</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7162254b-c2fe-4139-94ea-cc0f720a9b3d">
    <name>ИзменятьТипПропуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="961c74cb-fce1-43c3-af7f-b67d404817cb">
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6667f724-4527-4af9-9d26-f2ced65f4ed5">
    <name>ВыгружатьНаСайт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e43fec11-e2d6-4ba1-935e-cfc4047484d6">
    <name>Индивидуально</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="35688e1d-3d5d-4ba4-a2d2-a8ae02028ceb">
    <name>УровеньДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9dfb1156-61b0-4cf6-a749-49cf491b66af">
    <name>ЗапретитьСоздаватьПропуск</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="662ef78d-bb7a-4142-8543-46c55d375e3a">
    <name>ИзменятьПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0983b722-4b9b-4508-9502-eadb41d5ef36">
    <name>ТабельныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="25fb4b64-3389-40d8-a0fb-1a48696c5f69">
    <name>ДатаПеревода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="de354010-7d67-44cf-87d4-e48af516a477">
    <name>РольМобильногоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6020fb7b-5fb1-4cf3-a1df-ee412178682d">
    <name>ДолжностьЗУП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="44079ee7-c820-4e7e-90b6-b558be1c261a">
    <name>ПодразделениеЗУП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ae05a309-265f-484f-b720-0b93517910b0">
    <name>ОповещенияИзОчереди</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6d6189b4-cd43-4428-b345-8c04fb2cba4c">
    <name>ВышестоящееПодразделениеЗУП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="df0fd9e1-cd5c-4ecd-9102-493f1dbba937">
    <name>ВнутреннийТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="41e900a7-c10f-4f56-bc62-69d7108bc92e">
    <name>КорпоративныйТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1973c897-b5f8-4020-b1e7-47881040abeb">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0fdb6ac0-b230-43d6-b6e7-bd153e64f5a0">
    <name>Удаленщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7fb666be-2e07-4d2e-8843-dcec84180a27">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d44aa133-8703-4fc0-b5ff-67b13c6f1ea4">
    <name>ДопУтверждениеББ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="57989287-32be-4a51-8f5a-0c9a27b45041">
    <name>ПравоНаПроверку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0150eb34-5757-4b0a-b42e-18cb40c1f263">
    <name>ПравоНаСогласование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ba7e389d-4b02-43cb-9a13-1b3a0f9a4be1">
    <name>Аутсорс</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="de79966c-ad14-441f-95c9-e94a04bef8bc">
    <name>СписокЗон</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a6561ebb-def2-4423-834a-41631f1b243a">
      <name>ЗонаДоступа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="aff5c93c-abdd-44ce-86ba-3df5ea78303d">
    <name>РабочиеУчастки</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e6045355-ff14-41a0-a6e6-dba35c5249a7">
      <name>РабочийУчасток</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="e6b14f6a-ed6b-424d-92dd-c34e7f8b22e6">
    <name>БейджыВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d1e828b1-f591-4c25-9e7e-aeef3e67afb2">
      <name>ТранспортноеСредство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="806f21ff-78a2-4496-90c9-dfd5253a5be0">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>15</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="69aeacfc-4a6b-4d95-9201-ae704bbb53c0">
      <name>Наименование</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>60</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/CommonModules/АльтерраВзаимодействиеСБитрикс24/Module.bsl
#Область ЗапросВБ24

//"Стучится" в Б24. 
//
// Параметры:
// НазваниеМетода  - Строка - точные названия методов и их параметров 
//                 можно посмотреть тут: https://dev.1c-bitrix.ru/rest_help/index.php
//  ПараметрыМетода  - Структура - заголовки должны точно соответствовать существующим. 
//                 Их можно получить, также обратившись соответствующим запросом в Б24. 
//					Если одно из значений параметров метода - массив, его следует представить также структурой.
// ВернутьСтрокой - Булево - вернуть результат строкой или структурой
//
// Возвращаемое значение:
//   Структура, строка   - в зависимости от параметра. В случае ошибки возвращает структурой со свойством Error
//
Функция ВыполнитьПроизвольныйЗапрос(НазваниеМетода, ПараметрыМетода, ВернутьСтрокой=Ложь, HTTPСоединение=Неопределено, ВернутьТелоОтвета = Ложь) Экспорт
		
	Попытка
	
		ПараметрыЗапроса = СериализоватьВJSON(ПараметрыМетода);
		РезультатЗапроса = ВыполнитьЗапрос(НазваниеМетода, ПараметрыЗапроса, HTTPСоединение, ВернутьТелоОтвета);
		
		Если ВернутьСтрокой Тогда
			Возврат ПолучитьРезультатСтрокой(РезультатЗапроса);
		Иначе
			Возврат РезультатЗапроса;
		КонецЕсли;
	
	Исключение
		Сообщить("Сообщение в Битрикс24 не отправлено. Сервер системы Битрикс24 не работает!");
		Возврат Неопределено;	
	КонецПопытки;
	
КонецФункции

Функция ВыполнитьПроизвольныйЗапросБитрикс24(Метод, Знач ПараметрыЗапроса) Экспорт
	АдресСервера = "bitrix.tg-alterra.ru";

	token = Константы.ВебХук.Получить();	
	
	АдресРесурса = "/local/api/v1/" + Метод;
	
	ПараметрыЗапроса.Вставить("token", token);
	
	HTTPСоединение = Новый HTTPСоединение(АдресСервера, 443, , , ПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси("http"), , Новый ЗащищенноеСоединениеOpenSSL);
	
	Если ПараметрыЗапроса.login <> "" Тогда
		Запрос = Новый HTTPЗапрос(АдресРесурса + "?login=" + ПараметрыЗапроса.login + "&token=" + token);
		Ответ = HTTPСоединение.Получить(Запрос); 
		
		Если Ответ.КодСостояния = 200 Тогда
		   	Данные = Ответ.ПолучитьТелоКакСтроку();
			Ответ = ДесериализоватьИзJSON(Данные);
		Иначе
		    Ошибка = Новый Структура;
			Ошибка.Вставить("КодСостояния", Ответ.КодСостояния);
			НазваниеОшибки = Ответ.error;
			ОписаниеОшибки = Ответ.error_description;
			Ошибка.Вставить("НазваниеОшибки", НазваниеОшибки);
			Ошибка.Вставить("ОписаниеОшибки", ОписаниеОшибки);
			Возврат Ошибка;
		КонецЕсли; 
		Возврат Ответ; 
	Иначе
		Ошибка = Новый Структура; 
		Возврат Ошибка;
   	КонецЕсли;
КонецФункции

Функция ВыполнитьЗапрос(Метод, Знач ПараметрыЗапроса, HTTPСоединение=Неопределено, ВернутьТелоОтвета = Ложь) Экспорт
	АдресСервера = "bitrix.tg-alterra.ru";
	
	ВебХук=Константы.ВебХук.Получить();
	
	АдресРесурса = "/rest/1/"+ВебХук+"/" + Метод + ".json";

	Если HTTPСоединение=Неопределено Тогда
		HTTPСоединение = ПолучитьСоединение(Метод);
	КонецЕсли;     
	
	Если ТипЗнч(HTTPСоединение) = Тип("Строка") Тогда
		Сообщить("Ошибка: " + HTTPСоединение);
	    Возврат Неопределено;
	Иначе                              
		Заголовки = Новый Соответствие;
	    Заголовки.Вставить("Accept-Language", "ru");
	    Заголовки.Вставить("Accept-Charset", "utf-8");
	    Заголовки.Вставить("Content-Language", "ru");
	    Заголовки.Вставить("Content-Charset", "utf-8");
	    Заголовки.Вставить("Content-type", "application/json"); 
	    
	    HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
		HTTPЗапрос.УстановитьТелоИзСтроки(ПараметрыЗапроса);
	
	    HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	    ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
		
		Если ВернутьТелоОтвета Тогда
			Ответ = ТелоОтвета;
		ИначеЕсли Не (Метод = "tasks.task.add" ИЛИ Метод = "tasks.task.get"
			ИЛИ Метод = "calendar.section.get" 
			ИЛИ Метод = "bizproc.workflow.instances"
			ИЛИ Метод = "bizproc.task.list") Тогда 
			Ответ = ДесериализоватьИзJSON(ТелоОтвета);
		Иначе
			Ответ = ДесериализоватьИзJSONВСоответсвие(ТелоОтвета);
		КонецЕсли;
				
		Если HTTPОтвет.КодСостояния = 200 Тогда
			Возврат Ответ;
		Иначе
			Ошибка = Новый Структура;
			Ошибка.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
			ЭтоСоответствие = ТипЗнч(Ответ) = Тип("Соответствие");
			НазваниеОшибки = ?(ЭтоСоответствие, Ответ["error"], Ответ.error);
			ОписаниеОшибки = ?(ЭтоСоответствие, Ответ["error_description"], Ответ.error_description);
			Ошибка.Вставить("НазваниеОшибки", НазваниеОшибки);
			Ошибка.Вставить("ОписаниеОшибки", ОписаниеОшибки);
			Возврат Ошибка;
		КонецЕсли;
    КонецЕсли;
КонецФункции

//Установить соединение, если требуется сделать несколько запросов подряд 
//
// Параметры:
// АдресСервера  - Строка -  
// АдресРесурса  - Строка - 
//
// Возвращаемое значение:
//   HTTP соединение   
//
Функция ПолучитьСоединение(Метод, АдресСервера="", АдресРесурса="") Экспорт 
	АдресСервера = ?(АдресСервера="", "bitrix.tg-alterra.ru", АдресСервера);
	АдресРесурса = ?(АдресРесурса="", "/rest/1/qf9d1uvmxxhzxgw5/" + Метод + ".json", АдресРесурса);

	Попытка
		Возврат Новый HTTPСоединение(АдресСервера, 443, , , ПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси("http"), , Новый ЗащищенноеСоединениеOpenSSL); // соединяемся по https
	Исключение
		Возврат ОписаниеОшибки();
	КонецПопытки;
КонецФункции

Процедура ВыполнитьПрямойЗапрос(Метод,ПараметрыМетода) экспорт
	АдресСервера = "bitrix.tg-alterra.ru";
	Соединение = Новый HTTPСоединение(АдресСервера, 443, , , ПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси("http"), , Новый ЗащищенноеСоединениеOpenSSL); 		
	
	ВебХук=Константы.ВебХук.Получить();
	
	АдресРесурса = "/rest/1/"+ВебХук+"/" + Метод + ".json?";
	
	ТекстЗапроса=АдресРесурса;
	если типзнч(ПараметрыМетода)=тип("Структура") тогда
		для каждого стр из ПараметрыМетода цикл
			ТекстЗапроса=ТекстЗапроса+стр.ключ+"="+стр.Значение+"&";	
		конеццикла;	
		ТекстЗапроса=лев(ТекстЗапроса,стрдлина(ТекстЗапроса)-1);
	иначе
		ТекстЗапроса=ТекстЗапроса+ПараметрыМетода;
	конецесли;
	Запрос = Новый HTTPЗапрос(ТекстЗапроса);
	Результат = Соединение.Получить(Запрос);
КонецПроцедуры

#КонецОбласти

#Область ПредопределенныеОбращения

//Возвращает полную структуру данных пользователя. Если нужен только ID, то: Результат.result[0].ID
Функция ПолучитьПользователя(Пользователь = Неопределено, HTTPСоединение=Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Если Пользователь = Неопределено Тогда
		Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
		ПользовательОСДомен = Пользователь.ПользовательОС;
	иначеесли типзнч(Пользователь)=тип("СправочникСсылка.Сотрудники") тогда
		Пользователь = ПолучитьСправочникПользовательПоСотруднику(Пользователь);  
		СвойстваПользователя = Пользователи.СвойстваПользователяИБ(Пользователь.ИдентификаторПользователяИБ);
		ПользовательОСДомен = СвойстваПользователя.ПользовательОС;
	иначеесли типзнч(Пользователь)=тип("СправочникСсылка.ФизическиеЛица") тогда
		ПользовательПоФизлицу = ПолучитьПользователяПоФизЛицу(Пользователь);
		Если ПользовательПоФизлицу = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю("Физическое лицо """+ Пользователь +"""  не связано с пользователем. Проверьте настройки пользователя ИБ!");
		Иначе	
	    	СвойстваПользователя = Пользователи.СвойстваПользователяИБ(ПользовательПоФизлицу.ИдентификаторПользователяИБ);
			ПользовательОСДомен = СвойстваПользователя.ПользовательОС;
		КонецЕсли;
	иначеесли типзнч(Пользователь)=тип("СправочникСсылка.Пользователи") тогда  
		Если НЕ Пользователь = Справочники.Пользователи.ПустаяСсылка() Тогда
			СвойстваПользователя = Пользователи.СвойстваПользователяИБ(Пользователь.ИдентификаторПользователяИБ);
			ПользовательОСДомен = СвойстваПользователя.ПользовательОС;
		Иначе     
			ПользовательОСДомен = Пользователь.Наименование;	
		КонецЕсли;
	иначеесли типзнч(Пользователь)=тип("Строка") или типзнч(Пользователь)=тип("Число")  тогда
		Возврат Строка(Пользователь);
	КонецЕсли;  
	
	ПользовательОС = СтрЗаменить(ПользовательОСДомен, "\\ALTERRA\", ""); 
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("LOGIN",ПользовательОС);
		
	ПользовательБП = ВыполнитьПроизвольныйЗапросБитрикс24("user.get", ПараметрыЗапроса);
	УстановитьПривилегированныйРежим(Ложь);
    Возврат ПользовательБП;
КонецФункции

Функция ПолучитьСправочникПользовательПоСотруднику(Сотрудник)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО Сотрудники.Пользователь = Пользователи.Ссылка
	|ГДЕ
	|	Сотрудники.Ссылка = &Сотрудник"; 
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;		
	КонецЦикла;
	
КонецФункции

Функция ПолучитьПользователяПоФизЛицу(ФизическоеЛицо)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ФизическоеЛицо = &ФизическоеЛицо";
	Запрос.УстановитьПараметр("ФизическоеЛицо",ФизическоеЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;		
	КонецЦикла;
КонецФункции

Функция ПолучитьПользователяПоСотруднику(Сотрудник) Экспорт 
	ПользовательОС = Сотрудник.Наименование;
	Возврат ПолучитьПользователя(ПользовательОС);
КонецФункции

Функция ПолучитьИДПользователя(Пользователь=НЕОПРЕДЕЛЕНО) Экспорт

	ИДОтветственного ="";
	Ответственный = ПолучитьПользователя(Пользователь);
	Если Ответственный.Свойство("КодСостояния") Тогда
		ТекстОшибки = "Получение пользователя | " + ПолучитьРезультатСтрокой(Ответственный);
		ЗаписатьВЖурналРегистрации(ТекстОшибки);
		Возврат "";
	ИначеЕсли Ответственный.Свойство("result") Тогда
		РезультатЗапроса = Ответственный.result;
		Если РезультатЗапроса.Количество() > 0 Тогда
			Стр = РезультатЗапроса[0];
			ИДОтветственного = Стр.ID;
		КонецЕсли;
	КонецЕсли;

	Возврат ИДОтветственного;
КонецФункции

Функция ПолучитьСпискиНаСервере(ВернутьСтрокойJSON=Ложь)  Экспорт
	ПараметрыЗапроса = Новый Структура; 
    ПараметрыЗапроса.Вставить("IBLOCK_TYPE_ID","lists_socnet");
	ПараметрыЗапроса.Вставить("IBLOCK_ID","83");
	
    Возврат ВыполнитьПроизвольныйЗапрос("lists.element.get", ПараметрыЗапроса, ВернутьСтрокойJSON);
КонецФункции

//Работает с командой "get", которая возвращает конкретную сущность, если она существует и ошибку, если она не найдена
//
// Параметры:
// НазваниеСущности  - Строка - может принимать значения lead, deal и user. Для остальных сущностей команды get нет
// ИДСущности - строка - id экземпляра, который мы хотим получить
// НазваниеПоля - строка или структура - параметры, которые хотим получить из экземпляра
//
// Возвращаемое значение:
//   Массив, строка   - в зависимости от параметра. В случае ошибки возвращает структурой со свойством Error
//
Функция ПолучитьЗначениеПоляСущностиПоID(НазваниеСущности, ИДСущности, НазваниеПоля, HTTPСоединение=Неопределено) Экспорт

	Команда = "";
	Если НазваниеСущности="lead" или НазваниеСущности = "deal" Тогда
		Команда = "crm.";
	ИначеЕсли НазваниеСущности = "user" Тогда
	Иначе
	//сущность не имеет метода get	
	КонецЕсли;
	Команда = Команда + НазваниеСущности + ".get";
	СтруктураПараметров = Новый Структура;
	Ид_Ч = Формат(Число(ИДСущности), "ЧГ=0");
	СтруктураПараметров.Вставить("ID", Ид_Ч);                                                        
	РезультатЗапроса = ВыполнитьПроизвольныйЗапрос(Команда, СтруктураПараметров, , HTTPСоединение);
	Результат = Новый Структура;
	Если РезультатЗапроса.Свойство("result") Тогда
		СтруктураРезультат = РезультатЗапроса.result;
		Если ТипЗнч(НазваниеПоля) = Тип("Массив") Тогда
			Если ТипЗнч(СтруктураРезультат)=Тип("Массив") Тогда
				СтруктураРезультат = РезультатЗапроса.result[0];
			КонецЕсли;
			Для каждого Название из НазваниеПоля Цикл
				Если СтруктураРезультат.Свойство(Название) Тогда
					Результат.Вставить(Название, СтруктураРезультат[Название]);
				КонецЕсли;
			КонецЦикла;
		Иначе
			Если ТипЗнч(СтруктураРезультат) = Тип("Массив") Тогда
				СтрРезультат = СтруктураРезультат[0];
				Если ТипЗнч(НазваниеПоля) = Тип("Строка") Тогда
					Результат.Вставить(НазваниеПоля, СтрРезультат[НазваниеПоля]);
				Иначе
					Поля = НазваниеПоля;
					Для каждого Поле из Поля Цикл
						Результат.Вставить(Поле.Ключ, СтрРезультат[Поле.Ключ]);
					КонецЦикла;
				КонецЕсли;
			Иначе
				Если СтруктураРезультат.Свойство(НазваниеПоля) Тогда
					Результат.Вставить(НазваниеПоля, СтруктураРезультат[НазваниеПоля]);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		//ошибка
		ЗаписатьВЖурналРегистрации(ПолучитьРезультатСтрокой(РезультатЗапроса)+" | получение "+НазваниеСущности);
	КонецЕсли;
	Возврат Результат;
КонецФункции

//получить ид сущности клиента, если его нет в регистре
Функция ПолучитьИДКонтакта(Клиент, HTTPСоединение=Неопределено) Экспорт
	ФИО = ФизическиеЛицаУТ.ФамилияИмяОтчество(Клиент);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыКонтакта = Новый Структура; 
	ПараметрыКонтакта.Вставить("NAME",ФИО.Имя);
	ПараметрыКонтакта.Вставить("LAST_NAME",ФИО.Фамилия);
    ПараметрыКонтакта.Вставить("SECOND_NAME",ФИО.Отчество);
	ПараметрыЗапроса.Вставить("filter", ПараметрыКонтакта);
	ПараметрыОтвета = Новый Структура("ID", "");
	ПараметрыЗапроса.Вставить("select", ПараметрыОтвета);
	Ответ = ВыполнитьПроизвольныйЗапрос("crm.contact.list", ПараметрыЗапроса, , HTTPСоединение);
	КонтактИД = "";
	Если Ответ.Свойство("result") Тогда
		Если Ответ.result.Количество() > 0 Тогда
			КонтактИД = Ответ.result[0].ID;
		КонецЕсли;
	Иначе
		//ошибка
		ЗаписатьВЖурналРегистрации(ПолучитьРезультатСтрокой(Ответ)+ "| получение ИД контакта");
	КонецЕсли;
	
    Возврат КонтактИД;
КонецФункции

//"Стучится" в Б24, выхватывает сделку, если она есть 
//
// Параметры:
//  ПараметрыМетода  - Структура - заголовки должны точно соответствовать существующим. 
//                 Партнер 
//					Пользователь - либо строка ID, либо пользователь ИБ 
//                Лид (опционально)
//  HTTPСоединение - если требуется сделать несколько обращений в рамках одного соединения 
//
// Возвращаемое значение:
//   Строка  - возвращает ID сделки. Если сделка не найдена - пустая строка
//
Функция ЕстьСделка(ПараметрыМетода, HTTPСоединение=Неопределено) Экспорт
	//искать по полям:
	//партнер - CONTACT_IDS - РС Б24_Синхр_ИдентификаторыОбъектов.Идентификатор
	//пользователь, которому назначено - ASSIGNED_BY_ID
	//получить ИД пользователя
	Если ТипЗнч(ПараметрыМетода.Партнер)=Тип("Строка") Тогда 
		ИДКлиента = ПараметрыМетода.Партнер;
	Иначе
		ИДКлиента =ПолучитьИДКонтакта(ПараметрыМетода.Партнер);
	КонецЕсли;
	Если ИДКлиента="" Тогда
		Возврат "клиента нет";
	КонецЕсли;
	ПараметрыКоманды = Новый Структура;
	
	Фильтр = Новый Структура;
	
	Фильтр.Вставить("CONTACT_IDS", ИДКлиента);
	Если  ТипЗнч(ПараметрыМетода.Пользователь) <> Тип("Строка") Тогда
		Фильтр.Вставить("ASSIGNED_BY_ID", ПолучитьИДПользователя(ПараметрыМетода.Пользователь));
	Иначе
		Фильтр.Вставить("ASSIGNED_BY_ID", ПараметрыМетода.Пользователь);
	КонецЕсли;
	Если ПараметрыМетода.Свойство("Лид") Тогда
		Фильтр.Вставить("LEAD_ID", ПараметрыМетода.Лид);
	КонецЕсли;
	ВыбранныеПоля = Новый Структура;
	ВыбранныеПоля.Вставить("ID");
	
	ПараметрыКоманды.Вставить("filter", Фильтр);
	ПараметрыКоманды.Вставить("select", ВыбранныеПоля);
	
	Ответ = ВыполнитьПроизвольныйЗапрос("crm.deal.list", ПараметрыКоманды, , HTTPСоединение);
	СделкаНайдена = (Не Ответ.Свойство("НазваниеОшибки") И Ответ.total<>0);
	Если СделкаНайдена Тогда
		Если Ответ.Свойство("result") Тогда
			Возврат Ответ.result[0].ID;
		Иначе
			Возврат "";
		КонецЕсли;
	КонецЕсли;
	Возврат "";
КонецФункции

Функция ОтправитьСообщениеВБитрикс(ТелоСообщения, Сотрудник) Экспорт  

	Попытка 

		ПолучательСообщения = ПолучитьПользователя(Сотрудник);
		Если Не ПолучательСообщения.Свойство("result") Или ПолучательСообщения.result.Количество() = 0 Тогда
			Текст = "Учетная запись сотрудника " + Сотрудник + " не найдена. Проверьте настройки пользователя и повторите попытку";
			Сообщить(Текст);
			Возврат Неопределено;	
		КонецЕсли;
		IDПолучательСообщения = ПолучательСообщения.result[0].ID;
		ТекстСообщения = Строка(ТелоСообщения);
	    ПараметрыЗапроса = Новый Структура; 
		ПараметрыЗапроса.Вставить("DIALOG_ID", IDПолучательСообщения);
		ПараметрыЗапроса.Вставить("MESSAGE",ТекстСообщения);
				  
	    Возврат ВыполнитьПроизвольныйЗапрос("im.message.add", ПараметрыЗапроса);
    
	Исключение
		Сообщить("Сообщение в Битрикс24 не отправлено. Сервер системы Битрикс24 не работает!");
		Возврат Неопределено;	
	КонецПопытки;
    
КонецФункции      

Функция ОтправитьСообщениеВБитриксПоИДЧата(ТелоСообщения, ИДЧата) Экспорт 
	ТекстСообщения = Строка(ТелоСообщения);
    ПараметрыЗапроса = Новый Структура; 
	ПараметрыЗапроса.Вставить("DIALOG_ID", ИДЧата);
	ПараметрыЗапроса.Вставить("MESSAGE",ТекстСообщения);
			  
    Возврат ВыполнитьПроизвольныйЗапрос("im.message.add", ПараметрыЗапроса);
    
КонецФункции


Функция ПолучитьIDСделкиIDПартнера(НаименованиеПартнера) Экспорт 	
	Метод = "crm.deal.list";
	АдресСервера = "bitrix.tg-alterra.ru";
	АдресРесурса = "/rest/1/qf9d1uvmxxhzxgw5/" + Метод + ".json";

	select = Новый Массив;
	select.Добавить("ID");          // ID Сделки    
	select.Добавить("COMPANY_ID"); // ID Партнера    
	
	ПараметрыПоля = Новый Структура;		
	ПараметрыПоля.Вставить("order", Новый Структура("DATE_MODIFY", "DESC")); // Направление сортировки: "ASC", "DESC"     
	ПараметрыПоля.Вставить("filter", Новый Структура("COMPANY_ID, CATEGORY_ID, STAGE_SEMANTIC_ID", ПолучитьИдентификаторыПартнера(НаименованиеПартнера), "0", "P")); 
	ПараметрыПоля.Вставить("select", select);

	Ответ = ВыполнитьПроизвольныйЗапрос(Метод, ПараметрыПоля); 
	
	Если Ответ.Свойство("result") И 
		ТипЗнч(Ответ.result) = Тип("Массив") И 
		ЗначениеЗаполнено(Ответ.result) И 
		ЗначениеЗаполнено(Ответ.result[0].ID) И
		ЗначениеЗаполнено(Ответ.result[0].COMPANY_ID) Тогда
		Возврат Ответ.result[0];	
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ПолучитьИдентификаторыПартнера(НаименованиеПартнера)  	
	Метод = "crm.company.list";
	АдресСервера = "bitrix.tg-alterra.ru";
	АдресРесурса = "/rest/1/qf9d1uvmxxhzxgw5/" + Метод + ".json";
	
	Массив = Новый Массив;
	Массив.Добавить("ID");
	
	ПараметрыПоля = Новый Структура;
	ПараметрыПоля.Вставить("filter", Новый Структура("TITLE", НаименованиеПартнера)); 
	ПараметрыПоля.Вставить("select", Массив);

	Массив = ВыполнитьПроизвольныйЗапрос(Метод, ПараметрыПоля);
	
	Если Массив.Свойство("result") И ТипЗнч(Массив.result) = Тип("Массив") И ЗначениеЗаполнено(Массив.result) Тогда  	
		Массив = Массив.result;
		
		Для Инд = 0 По Массив.Количество() - 1 Цикл
			Массив[Инд] = Массив[Инд].ID;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Массив;
КонецФункции

Функция ОтправитьВЧат(НазваниеЧата, ТекстСообщения) Экспорт                                           
	
	СписокЧатов = ПолучитьЧаты(НазваниеЧата);    
	ТекстНеудачногоПоиска = "Чат " + НазваниеЧата + " не найден. Возможно пользователь ""Alterra24"" отсутствует в списке пользователей чата.";
	
	Если Не СписокЧатов.Свойство("result") Или СписокЧатов.result.Количество() = 0 Тогда
		Сообщить(ТекстНеудачногоПоиска);
		Возврат Неопределено;	
	КонецЕсли;    
	
    НайденныйЧат = Неопределено;
	Для Каждого Элемент Из СписокЧатов.result Цикл
		Если Элемент.name = НазваниеЧата Тогда
			НайденныйЧат = Элемент.id;   
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если НайденныйЧат <> Неопределено Тогда
		IDЧата = "chat" +  Формат(НайденныйЧат, "ЧГ=");
		ПараметрыЗапроса = Новый Структура; 
		ПараметрыЗапроса.Вставить("DIALOG_ID", IDЧата); 
		ПараметрыЗапроса.Вставить("MESSAGE", ТекстСообщения);  
					  
		Результат = ВыполнитьПроизвольныйЗапрос("im.message.add", ПараметрыЗапроса);  
		Возврат Результат;    
	Иначе
		Сообщить(ТекстНеудачногоПоиска); 
		Возврат Неопределено;	
	КонецЕсли;
КонецФункции   

Функция ПолучитьЧаты(НазваниеЧата, HTTPСоединение=Неопределено) Экспорт 
	
	ПараметрыЗапроса = Новый Структура; 
	ПараметрыЗапроса.Вставить("FIND", НазваниеЧата);
	
	СписокЧатов = ВыполнитьПроизвольныйЗапрос("im.search.chat.list", ПараметрыЗапроса, , HTTPСоединение);
    Возврат СписокЧатов;
КонецФункции

Функция ПолучитьКалендариПользователя(СтруктураПараметров, ВернутьСтрокойJSON = Ложь) Экспорт 
	
    ПараметрыЗапроса = Новый Структура; 
	ПараметрыЗапроса.Вставить("type", СтруктураПараметров.ТипКалендаря);
	ПараметрыЗапроса.Вставить("ownerId",СтруктураПараметров.ИДВладельцаКалендаря); 
	
	Возврат АльтерраВзаимодействиеСБитрикс24.ВыполнитьПроизвольныйЗапрос("calendar.section.get", ПараметрыЗапроса, ВернутьСтрокойJSON)["result"];
	
КонецФункции  

// Универсальная функция отправки сообщений в задачи и личные сообщения Битрикс24 под конкретным сотрудником из хранилища
// Параметры:
//   idПользователя - Строка - idБота от которого идут действия
//   Метод - Строка - Метод api битрикс
//   Сотрудник - Строка - ФИО получателя сообщения (используется функция ПолучитьПользователя)
//   ТелоСообщения - Строка - текст сообщения бота
//   IDЗадачи - Строка - ID задачи (обязателен для метода task.commentitem.add)
// Пример:
//	 АльтерраВзаимодействиеСБитрикс24.ВыполнитьЗапросУниверсальный("4008", "im.message.add", Пользователи.НайтиПоИмени("ЗахаровНС"), "ТестНовойФункции"); - Отправка сообщения в лс
//	 АльтерраВзаимодействиеСБитрикс24.ВыполнитьЗапросУниверсальный("4008", "task.commentitem.add" ,, "ТестНовойФункции", "157458"); - Отправка сообщения в задачу 
//	 Тело = Новый Структура;
//	 Тело.Вставить("ТекстЗаголовок", "Короткий заголовок");
//	 Тело.Вставить("ТекстДляЖивойЛенты", "Основной текст поста");
//	 Тело.Вставить("ПолучательСообщения", "Группа 'Коммерческие вопросы'");
//	 Тело.Вставить("ВажноеСообщение", Истина);
//	 Тело.Вставить("МассивФайлов", МассивФайлов); 
//	 АльтерраВзаимодействиеСБитрикс24.ВыполнитьЗапросУниверсальный("4008", "log.blogpost.add", "", Тело); - Сообщение в ленту
Функция ВыполнитьЗапросУниверсальный(idПользователя, Метод, Сотрудник = "", ТелоСообщения, IDЗадачи = "") Экспорт
	
	Результат = Новый Структура;
    Результат.Вставить("ОписаниеОшибки", ""); 
	Результат.Вставить("Данные", Неопределено);
    
    Попытка
        ХранилищеСсылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Настройки хранилища"); 
        Хранилище = ХранилищеСсылка.ХранилищеНастроек.Получить();
        
        Если Хранилище = Неопределено Тогда
            Результат.ОписаниеОшибки = "Хранилище не найдено";
            Возврат Результат;
        КонецЕсли;
		
		Отбор = Новый Структура("idПользователя, Метод");
		Отбор.idПользователя = idПользователя;
		Отбор.Метод = Метод;
		НастройкиВебхука = Хранилище.НастройкиВебхуковБотов.ТаблицаЗначений;
		
		ВебхукХранилище = НастройкиВебхука.НайтиСтроки(Отбор);
		
		Если ВебхукХранилище.Количество() = 0 Тогда
			Результат.ОписаниеОшибки = "Указан неверный idПользователя или метод в хранилище";
			Возврат Результат;
		КонецЕсли;
	
		idПользователя = ВебхукХранилище[0].idПользователя;
        АдресСервера = ВебхукХранилище[0].АдресСервера;
        Вебхук = ВебхукХранилище[0].Вебхук;
        Метод = ВебхукХранилище[0].Метод; 
		
		Если ВРег(Метод) = "IM.MESSAGE.ADD" Тогда
	
			ПолучательСообщения = ПолучитьПользователя(Сотрудник);
	        IDПолучателя = ПолучательСообщения.result[0].ID;
			
			МетодAPI = "im.message.add";
	        ПараметрыЗапроса = Новый Структура;
	        ПараметрыЗапроса.Вставить("DIALOG_ID", IDПолучателя);
	        ПараметрыЗапроса.Вставить("MESSAGE", Строка(ТелоСообщения));
		
		ИначеЕсли ВРег(Метод) = "TASK.COMMENTITEM.ADD" Тогда 
		
	        Если Не ЗначениеЗаполнено(IDЗадачи) Тогда
	            Результат.ОписаниеОшибки = "ID задачи обязателен для метода отправки в задачи";
	            Возврат Результат;
			КонецЕсли;
			
			
	        МетодAPI = "task.commentitem.add";
	        ПараметрыЗапроса = Новый Структура;
	        ПараметрыЗапроса.Вставить("ID", IDЗадачи);
	        
	        ПараметрыКомментария = Новый Структура;
	        ПараметрыКомментария.Вставить("POST_MESSAGE", Строка(ТелоСообщения));
	        ПараметрыЗапроса.Вставить("FIELDS", ПараметрыКомментария); 
			
		ИначеЕсли ВРег(Метод) = "LOG.BLOGPOST.ADD" Тогда
	    
	        Если ТипЗнч(ТелоСообщения) <> Тип("Структура") Тогда
	            Результат.ОписаниеОшибки = "Для метода log.blogpost.add необходимо передать структуру параметров";
	            Возврат Результат;
	        КонецЕсли;
	        
	        Если Не ТелоСообщения.Свойство("ТекстЗаголовок") ИЛи Не ТелоСообщения.Свойство("ТекстДляЖивойЛенты") ИЛи Не ТелоСообщения.Свойство("ПолучательСообщения") Тогда
	            Результат.ОписаниеОшибки = "В структуре должны быть ТекстЗаголовок, ТекстДляЖивойЛенты и ПолучательСообщения";
	            Возврат Результат;
	        КонецЕсли;
	        
	        МетодAPI = "log.blogpost.add";
	        ПараметрыЗапроса = Новый Структура;
	        ПараметрыЗапроса.Вставить("POST_TITLE", ТелоСообщения.ТекстЗаголовок);
	        ПараметрыЗапроса.Вставить("POST_MESSAGE", ТелоСообщения.ТекстДляЖивойЛенты);
	        
	        Если ТелоСообщения.Свойство("МассивФайлов") И ТелоСообщения.МассивФайлов <> Неопределено Тогда
	            ПараметрыЗапроса.Вставить("FILES", ТелоСообщения.МассивФайлов);
	        КонецЕсли;
	        
	        Получатель = ТелоСообщения.ПолучательСообщения;
	        Если Получатель = "Группа 'Коммерческие вопросы'" Тогда
	            ПараметрыЗапроса.Вставить("DEST", Новый Структура("SG", "SG46"));
	        ИначеЕсли Получатель = "Группа 'Руководители подразделений'" Тогда
	            ПараметрыЗапроса.Вставить("DEST", Новый Структура("SG", "SG59"));
	        ИначеЕсли Получатель = "Группа 'Руководители'" Тогда
	            ПараметрыЗапроса.Вставить("DEST", Новый Структура("SG", "SG171"));
	        Иначе
	            Результат.ОписаниеОшибки = "Не найден получатель сообщения: " + Получатель;
	            Возврат Результат;
	        КонецЕсли;
	        
	        Если ТелоСообщения.Свойство("ВажноеСообщение") И ТелоСообщения.ВажноеСообщение Тогда
	            ПараметрыЗапроса.Вставить("IMPORTANT", "Y");
	        КонецЕсли;
			
			ПараметрыЗапроса.Вставить("USER_ID", idПользователя);	 
		Иначе
	        Результат.ОписаниеОшибки = "Неизвестный метод: " + Метод;
	        Возврат Результат;
		КонецЕсли;
		
	    ДанныеРезультата = ВыполнитьЗапросСВебхуком(АдресСервера, idПользователя, Вебхук, МетодAPI, ПараметрыЗапроса);
		
		Если ДанныеРезультата <> Неопределено Тогда
	        Результат.Данные = ДанныеРезультата;
	    Иначе
	        Результат.ОписаниеОшибки = "Запрос выполнен, но результат не получен";
	    КонецЕсли;
		
		Возврат Результат
		
	Исключение
	    Результат.ОписаниеОшибки = Результат.ОписаниеОшибки + ОписаниеОшибки();
	    Возврат Результат;
	КонецПопытки;
	
КонецФункции	

Функция ВыполнитьЗапросСВебхуком(АдресСервера, idПользователя, Вебхук, Метод, ПараметрыМетода) Экспорт
    
    Попытка
        АдресРесурса = "/rest/" + idПользователя + "/" + Вебхук + "/" + Метод + ".json";
        
        HTTPСоединение = Новый HTTPСоединение(АдресСервера, 443, , , ПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси("http"), , Новый ЗащищенноеСоединениеOpenSSL);
        
        Заголовки = Новый Соответствие;
        Заголовки.Вставить("Accept-Language", "ru");
        Заголовки.Вставить("Accept-Charset", "utf-8");
        Заголовки.Вставить("Content-Language", "ru");
        Заголовки.Вставить("Content-Charset", "utf-8");
        Заголовки.Вставить("Content-type", "application/json");
        
        HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
        ПараметрыJSON = СериализоватьВJSON(ПараметрыМетода);
        HTTPЗапрос.УстановитьТелоИзСтроки(ПараметрыJSON);
        
        HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
        ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
        
        Если Метод = "task.commentitem.add" Тогда
            Ответ = ДесериализоватьИзJSONВСоответсвие(ТелоОтвета);
        Иначе
            Ответ = ДесериализоватьИзJSON(ТелоОтвета);
        КонецЕсли;
        
        Если HTTPОтвет.КодСостояния = 200 Тогда
            Возврат Ответ;
        Иначе
            Ошибка = Новый Структура;
            Ошибка.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
            ЭтоСоответствие = ТипЗнч(Ответ) = Тип("Соответствие");
            НазваниеОшибки = ?(ЭтоСоответствие, Ответ["error"], Ответ.error);
            ОписаниеОшибки = ?(ЭтоСоответствие, Ответ["error_description"], Ответ.error_description);
            Ошибка.Вставить("НазваниеОшибки", НазваниеОшибки);
            Ошибка.Вставить("ОписаниеОшибки", ОписаниеОшибки);
            Возврат Ошибка;
        КонецЕсли;
        
    Исключение
        Сообщить("Ошибка выполнения запроса: " + ОписаниеОшибки());
        Возврат Неопределено;
    КонецПопытки;
    
КонецФункции



#Область ЗагрузкаФайлов

// Загружает несколько файлов в Б24 в указанную папку
//
// Параметры:
//  ИдПапки  - Строка - ИД папки для файлов в Б24 (указывать в справочнике настроек - Альтерра_НастройкиОбменаБитрикс, рек.ИдПапкиСФайлами)
//
//  МассивФайлов  - Массив - массив с файлами
//
//  Пользователь  - СправочникСсылка.Пользователи - автор записи
//  
//  КодЭлементаПроцесса  - Строка - гуид объекта-владельца строкой
//  
// Возвращаемое значение:
//   Массив   - структура с ИД загруженных файлов
//
Функция ЗагрузитьФайлыВБитрикс(ИдПапки, МассивФайлов, Пользователь, КодЭлементаПроцесса) Экспорт

	МассивИДФайлов = Новый Структура();
	НомерФайла = 0;
	Для НомерФайла=0 по МассивФайлов.Количество()-1 Цикл
		ИдФайла = ЗагрузитьФайлНаСервере(ИдПапки, МассивФайлов[НомерФайла], Пользователь, КодЭлементаПроцесса);
		Если ЗначениеЗаполнено(ИдФайла) Тогда
			Ид = СтрЗаменить(Строка(ИдФайла.result.ID),Символы.НПП,"");;
			МассивИдФайлов.Вставить("n"+Строка(НомерФайла+1),"n"+Ид);
		КонецЕсли;
	КонецЦикла;
	Возврат МассивИДФайлов;

КонецФункции

//загрузка одного файла
Функция ЗагрузитьФайлНаСервере(ИдПапки, Файл, Пользователь, КодЭлементаПроцесса) Экспорт
	
	СтруктураФайла = РаботаСФайлами.ДанныеФайла(Файл);
	ЗнФайла = ПолучитьИзВременногоХранилища(СтруктураФайла.СсылкаНаДвоичныеДАнныеФайла);

	Бэйз64Строка = Base64Строка(ЗнФайла);
    Бэйз64Строка = СтрЗаменить(Бэйз64Строка, Символы.ВК, "");
    Бэйз64Строка = СтрЗаменить(Бэйз64Строка, Символы.ПС, "");

	ПараметрыЗапроса = Новый Структура; 
    ПараметрыЗапроса.Вставить("id",ИдПапки);
   	ПараметрыЗапроса.Вставить("data",Новый Структура("NAME,CREATED_BY,UPDATED_BY",Файл.Наименование + "_"+Строка(КодЭлементаПроцесса)+"."+Строка(Файл.Расширение),Пользователь,Пользователь));
    ПараметрыЗапроса.Вставить("fileContent",Бэйз64Строка);
    
    Возврат ВыполнитьПроизвольныйЗапрос("disk.folder.uploadfile", ПараметрыЗапроса);
КонецФункции

#КонецОбласти

//	Значения параметра ПолучательСообщения: 
//		Группа 'Коммерческие вопросы'
//		Группа 'Руководители подразделений'
//		Группа 'Руководители'
Функция СообщениеВЖивуюЛенту(ТекстЗаголовок, ТекстДляЖивойЛенты, МассивФайлов = Неопределено, ПолучательСообщения, ВажноеСообщение = Ложь) Экспорт
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("POST_TITLE", ТекстЗаголовок);
	ПараметрыМетода.Вставить("POST_MESSAGE", ТекстДляЖивойЛенты);
	
	Если МассивФайлов <> Неопределено Тогда
		ПараметрыМетода.Вставить("FILES", МассивФайлов);
	КонецЕсли;
	
	Если ПолучательСообщения = "Группа 'Коммерческие вопросы'" Тогда
		ПараметрыМетода.Вставить("DEST", Новый Структура("SG", "SG46"));
	ИначеЕсли ПолучательСообщения = "Группа 'Руководители подразделений'" Тогда
		ПараметрыМетода.Вставить("DEST", Новый Структура("SG", "SG59"));
	ИначеЕсли ПолучательСообщения = "Группа 'Руководители'" Тогда
		ПараметрыМетода.Вставить("DEST", Новый Структура("SG", "SG171"));
	Иначе
		Возврат "Не найден получатель сообщения!";
	КонецЕсли;
	//ПараметрыМетода.Вставить("DEST", Новый Структура("U", "U6987"));  // На конкретного пользователя(для тестирования)         
	
	Если ВажноеСообщение Тогда 
		ПараметрыМетода.Вставить("IMPORTANT", "Y");
	КонецЕсли;
	
	ПараметрыМетода.Вставить("USER_ID", ПолучитьИДПользователя());	
	
	АдресСервера = "bitrix.tg-alterra.ru";
	Соединение = Новый HTTPСоединение(АдресСервера, 443, , , ПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси("http"), , Новый ЗащищенноеСоединениеOpenSSL);
	НазваниеОшибки = "";
	ОписаниеОшибки = "";
				 
	Для КоличествоПопыток = 1 По 3 Цикл
		
		Результат = ВыполнитьПроизвольныйЗапрос("log.blogpost.add", ПараметрыМетода, Ложь, Соединение);
		
		Если Результат.Свойство("result") Тогда
			Возврат "";
		Иначе
			НазваниеОшибки = Результат.НазваниеОшибки;
			ОписаниеОшибки = Результат.ОписаниеОшибки;
		КонецЕсли;
	КонецЦикла; 
	
	Возврат "Не удалось отправить сообщение! НазваниеОшибки: " + НазваниеОшибки + ". ОписаниеОшибки: " + ОписаниеОшибки;
	
КонецФункции

//Если всё хорошо - возвращает ID лида. Если всё плохо - возвращает описание ошибки строкой. Мож
//
// Параметры:
//  ПараметрыМетода  - Структура (или массив структур) - содержит поля: "Партнер", "Потенциал", "АктуальныйУТСК", "ФазаСтроительства"
//
// Возвращаемое значение:
//   Строка   - ID созданного лида (или массив созданных ID). Если ошибка - возвращает пустую строку
//
Функция СоздатьЛид(ПараметрыМетода)  Экспорт
	Метод = "crm.lead.add";
	АдресСервера = "bitrix.tg-alterra.ru";
	АдресРесурса = "/rest/1/qf9d1uvmxxhzxgw5/" + Метод + ".json";
		
	ПараметрыПоля = Новый Структура;
	ПараметрыПоля.Вставить("TITLE", Строка(ПараметрыМетода.Партнер));
	ПараметрыПоля.Вставить("OPPORTUNITY", ПараметрыМетода.Потенциал);
	ПараметрыПоля.Вставить("UF_CRM_1580785917214", "141");
	ПараметрыПоля.Вставить("STATUS_ID", "NEW");
	ИДКлиента = ПолучитьИДКонтакта( ПараметрыМетода.Партнер);
	
	Если ИДКлиента<>"" Тогда 
		  ПараметрыПоля.Вставить("CONTACT_ID", ИДКлиента);
	КонецЕсли;
	
	ПараметрыПоля.Вставить("ASSIGNED_BY_ID", ПолучитьИДПользователя(ПараметрыМетода.АктуальныйУТСК));
	ПараметрыПоля.Вставить("SOURCE_DESCRIPTION", "Появился новый клиент с активной фазой "+ ПараметрыМетода.ФазаСтроительства + ". Назначьте ответственного.");
	
	ПараметрыВывода = Новый Структура;
	ПараметрыВывода.Вставить("REGISTER_SONET_EVENT", "N");
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("fields", ПараметрыПоля);
	ПараметрыЗапроса.Вставить("params", ПараметрыВывода);

	Ответ = ВыполнитьПроизвольныйЗапрос(Метод, ПараметрыЗапроса);
	Результат = "";
	//если вернулась ошибка
	Если Ответ.Свойство("КодСостояния") Тогда
		//запись в журнал регистрации об ошибке
		ТекстОшибки = "Создание лида | " + ПолучитьРезультатСтрокой(Ответ) ;
		ЗаписатьВЖурналРегистрации(ТекстОшибки);
	ИначеЕсли Ответ.Свойство("result") Тогда
		Результат = Ответ.result;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

//Получает массив id задач в Битриксе
//Возвращает структуру с 
//МассивID - Массив id полученных задач 
//МассивДат - Массив с датами создания задач
//МассивСтатусов - Массив статусов по задачам (2 не выполнялась, 5 - завершена)
//МассивКрайнихСроков - Массив дат с крайними сроками  
Функция ПолучитьСтатусыПоЗадачам(МассивID) экспорт 
	МассивДат = Новый массив; 
	МассивСтатусов = Новый массив;
	МассивКрайнихСроков = Новый массив; 
	
	Для каждого ID из МассивID Цикл
		Параметры = Новый Структура; 
		Параметры.Вставить("taskId", ID);
		МассивВозврата = Новый Массив; 
		МассивВозврата.Добавить("STATUS");
		МассивВозврата.Добавить("ID");
		МассивВозврата.Добавить("CREATED_DATE");
		МассивВозврата.Добавить("DEADLINE");
		Параметры.Вставить("select", МассивВозврата);
		Ответ = ВыполнитьПроизвольныйЗапрос("tasks.task.get", Параметры);
		Результат = Ответ["result"];
		Ответ = Результат["task"];
		Статус = Ответ["status"];
		ДатаНачалаСтрокой = Ответ["createdDate"];
		КрайнийСрокСтрокой = Ответ["deadline"];
		СтрокаПромежуточная = Сред(ДатаНачалаСтрокой,0 , 4)+Сред(ДатаНачалаСтрокой, 6, 2)+Сред(ДатаНачалаСтрокой, 9, 2)+Сред(ДатаНачалаСтрокой, 12, 2)+Сред(ДатаНачалаСтрокой, 15, 2)+Сред(ДатаНачалаСтрокой, 18, 2); 
		ДатаНачала = Дата(СтрокаПромежуточная); 
		СтрокаПромежуточная = Сред(КрайнийСрокСтрокой,0 , 4)+Сред(КрайнийСрокСтрокой, 6, 2)+Сред(КрайнийСрокСтрокой, 9, 2)+Сред(КрайнийСрокСтрокой, 12, 2)+Сред(КрайнийСрокСтрокой, 15, 2)+Сред(КрайнийСрокСтрокой, 18, 2);
		КрайнийСрок = Дата(СтрокаПромежуточная); 
		МассивДат.Добавить(ДатаНачала); 
		МассивСтатусов.Добавить(Статус); 
		МассивКрайнихСроков.Добавить(КрайнийСрок);
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("МассивID", МассивID);
	Результат.Вставить("МассивДат", МассивДат);
	Результат.Вставить("МассивСтатусов", МассивСтатусов);
	Результат.Вставить("МассивКрайнихСроков", МассивКрайнихСроков);

	Возврат Результат; 
КонецФункции 

//Функция создает задачу в Битрикс. Получает Струтуру параметров 
//Поставновщик - ссылка на постановщика
//Ответственные - Массив ссылок на отвественных - 1 - отвестственный - далее соисполнители
//Наблюдатели - Массив ссылок на наблюдателей
//Заголовок - Строка заголовка
//Описание = Многострочная строка описания
//КрайнийСрок - дата крайнего срока
//ИДГруппы - ИД группы в которую встает новая задача
//ИДРодительскойЗадачи - ИД задачи, которая становится родительской для новой 
//Возвращает id новой задачи
Функция СоздатьЗадачу(СтруктураПараметров) Экспорт 
	Параметры = Новый Структура; 
	Параметры.Вставить("TITLE", СтруктураПараметров.Заголовок); 
	Параметры.Вставить("DESCRIPTION", СтруктураПараметров.Описание); 
	Параметры.Вставить("DEADLINE", СтруктураПараметров.КрайнийСрок); 
	Параметры.Вставить("GROUP_ID", СтруктураПараметров.ИДГруппы); 
	Параметры.Вставить("PARENT_ID", СтруктураПараметров.ИДРодительскойЗадачи);
		
	//Вытаскиваем все id пользователей 
	ИДПостановщика = ПолучитьИДПользователя(СтруктураПараметров.Постановщик); 
	Ответственные = СтруктураПараметров.Ответственные; 
	ИДСоисполнителей = Новый Массив; 
	ОтвВыбран = Ложь; 
	Для Каждого Ответственный из Ответственные Цикл 
		Если не ОтвВыбран Тогда 
			ИДОтветственного = ПолучитьИДПользователя(Ответственный); 
			ОтвВыбран = Истина; 
		Иначе
			ИДСоисполнителей.Добавить(ПолучитьИДПользователя(Ответственный)); 
		КонецЕсли; 
	КонецЦикла; 
	ИДНаблюдателей = Новый Массив; 
	Наблюдатели = СтруктураПараметров.Наблюдатели; 
	Для Каждого Наблюдатель из Наблюдатели Цикл 
		ИДНаблюдателей.Добавить(ПолучитьИДПользователя(Наблюдатель)); 
	КонецЦикла; 
	
	Параметры.Вставить("CREATED_BY", ИДПостановщика);
	Параметры.Вставить("RESPONSIBLE_ID", ИДОтветственного);
	Параметры.Вставить("ACCOMPLICES", ИДСоисполнителей);
	Параметры.Вставить("AUDITORS",ИДНаблюдателей);
	
	Ответ = ВыполнитьПроизвольныйЗапрос("tasks.task.add", новый структура("fields", Параметры));
	Результат = Ответ["result"];
	Ответ = Результат["task"];
	id = Ответ["id"];
	Если id <> неопределено Тогда 
		Сообщить("Задача № " +id +" создана!");
	Иначе
		Сообщить("Ошибка в создании задачи"); 
	КонецЕсли; 
	Возврат id;
КонецФункции   

Функция ЗапуститьБП(ПараметрыЗапроса) Экспорт 	
	Возврат ВыполнитьПроизвольныйЗапрос("lists.element.add", ПараметрыЗапроса);  	
КонецФункции   

//загрузка одного файла по двоичным данным
Функция ЗагрузитьФайл(Структура) Экспорт
    Возврат ВыполнитьПроизвольныйЗапрос("disk.folder.uploadfile", Структура);
КонецФункции
	
//Если всё хорошо - возвращает ID сделки. Если всё плохо - возвращает описание ошибки строкой
//
//Параметры:
//ПараметрыМетода  - структура - Заголовок, Партнер, Пользователь, Сумма
//
Функция СоздатьСделку(ПараметрыМетода) Экспорт
	ПараметрыПоля = Новый Структура;
	ПараметрыПоля.Вставить("TITLE", ПараметрыМетода.Заголовок);
	ПараметрыПоля.Вставить("OPENED", "Y");
	ПараметрыПоля.Вставить("ASSIGNED_BY_ID", ПолучитьИДПользователя(ПараметрыМетода.Пользователь));
	ПараметрыПоля.Вставить("CURRENCY_ID", "RUB");
	ПараметрыПоля.Вставить("BEGINDATE", ФорматироватьДату(ТекущаяДата()));
	ПараметрыПоля.Вставить("OPPORTUNITY", ПараметрыМетода.Сумма);
	ПараметрыПоля.Вставить("SOURCE_DESCRIPTION",  "Сделка создана автоматически, т.к. клиент имеет корректно заполненную фазу активного строительства.");
	ИДКлиента = ПолучитьИДКонтакта(ПараметрыМетода.Партнер);
	Если ИДКлиента<>"" Тогда 
		  ПараметрыПоля.Вставить("CONTACT_IDS", ИДКлиента);
	КонецЕсли;
	ПараметрыРегистрацииБ = Новый Структура;
	ПараметрыРегистрацииБ.Вставить("REGISTER_SONET_EVENT", "N");
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("fields", ПараметрыПоля);
	СтруктураПараметров.Вставить("params", ПараметрыРегистрацииБ);
	
	Ответ = ВыполнитьПроизвольныйЗапрос("crm.deal.add", СтруктураПараметров, Истина);
	Результат = "";
	Если Ответ.Свойство("result") Тогда
		  Результат = Ответ.result;
	  Иначе
		  ЗаписатьВЖурналРегистрации("Ошибка при создании сделки в Б24." + ПолучитьРезультатСтрокой(Ответ)) ;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция СоздатьДело(ПараметрыМетода) Экспорт
	Метод = "crm.activity.add";
	АдресСервера = "bitrix.tg-alterra.ru";
	АдресРесурса = "/rest/1/qf9d1uvmxxhzxgw5/" + Метод + ".json";
		
	COMMUNICATIONS = Новый Структура;
	COMMUNICATIONS.Вставить("ENTITY_ID", ПараметрыМетода.IDПартнера);
	COMMUNICATIONS.Вставить("ENTITY_TYPE_ID", 4); // 3 контакт / 4 компания (crm.enum.ownertype) 
	COMMUNICATIONS.Вставить("VALUE", ПараметрыМетода.ТелефонИлиEmailПартнера);

	Массив = Новый Массив;
	Массив.Добавить(COMMUNICATIONS);

	ПараметрыПоля = Новый Структура;
	ПараметрыПоля.Вставить("OWNER_TYPE_ID", 2); // Тип сущности для привязки к делу (crm.enum.ownertype) 2 - тип "сделка"
	ПараметрыПоля.Вставить("OWNER_ID", Число(ПараметрыМетода.IDПоследнейСделкиПоПартнеру)); //id сделки
	ПараметрыПоля.Вставить("RESPONSIBLE_ID",ПараметрыМетода.Ответственный);
	ПараметрыПоля.Вставить("SUBJECT", ПараметрыМетода.Тема); 	
	ПараметрыПоля.Вставить("COMMUNICATIONS", Массив); // (crm_activity_communication)
	ПараметрыПоля.Вставить("DESCRIPTION", ПараметрыМетода.Описание); 
	ПараметрыПоля.Вставить("TYPE_ID", ПараметрыМетода.ВстречаИлиЗвонок); // Тип дела. 1 встреча / 2 звонок (crm_enum_activitytype)
	Если ПараметрыМетода.ВстречаИлиЗвонок = 2 Тогда 
		ПараметрыПоля.Вставить("DIRECTION", 2);  // Направление дела: 1 входящее / 2 исходящее	(crm.enum.activitydirection)
	КонецЕсли;                                  // Используется только для звонков и писем, для встреч не используется
	ПараметрыПоля.Вставить("START_TIME", ПараметрыМетода.ДатаИВремяНачала);
	ПараметрыПоля.Вставить("END_TIME", ПараметрыМетода.ДатаИВремяОкончания);    
	
	Возврат ВыполнитьПроизвольныйЗапрос(Метод, Новый Структура("fields", ПараметрыПоля));
КонецФункции

#Область СозданиеБП
//пример результата: администрирование битрикс, Контенкт/Списки групп соцсети/Заявки клиентов от Call-центра.
//несколько типов БП, уточнить чем отличаются: из рег.задания, из документа (ф-я из модуля РасширениеДляРазработки.Спр_ОтправкаДанныхЧерезRestApiБитрикса)
//
//Параметры:
//ПараметрыМетода  - структура - Пользователь (МАП или УТСК), Партнер, ТекстЗаголовка, Описание 
//
Функция СоздатьБП(ПараметрыМетода) Экспорт
	Сотрудник = ПолучитьИДПользователя(ПараметрыМетода.Пользователь);
	Клиент = ПараметрыМетода.Партнер;
		
    ТекущаяДата = ФорматироватьДату(ТекущаяДата());
	
	КодЭлементаПроцесса = Строка(Клиент.Код)+"_"+ТекущаяДата;

	ДатаНачалаАктивности = Строка(ТекущаяДата());
	
	СтруктураД  = Новый Структура();
	
	СтруктураД.Вставить("NAME", ПараметрыМетода.ТекстЗаголовка);
	
	СтруктураД.Вставить("PROPERTY_354", "863");
	СтруктураД.Вставить("PROPERTY_342", ПолучитьКодПодразделения(ПараметрыМетода.Пользователь.Подразделение));
	СтруктураД.Вставить("PROPERTY_343", "1526");
	СтруктураД.Вставить("PROPERTY_345", Сотрудник);
	СтруктураД.Вставить("PROPERTY_710", "1174");

	СтруктураД.Вставить("DETAIL_TEXT", ПараметрыМетода.Описание);
	СтруктураД.Вставить("DETAIL_TEXT_TYPE", "text");
	СтруктураД.Вставить("ACTIVE_FROM", ДатаНачалаАктивности);
	
	РезультатОтправки = ДобавитьНовыйЭлементСпискаРабочейГруппы(КодЭлементаПроцесса,СтруктураД); 
 КонецФункции

Функция ДобавитьНовыйЭлементСпискаРабочейГруппы(КодЭлементаПроцесса, СтруктураПараметров, ВернутьСтрокойJSON=Ложь) Экспорт  
	
    ПараметрыЗапроса = Новый Структура; 
	ПараметрыЗапроса.Вставить("IBLOCK_TYPE_ID","lists_socnet");
	ПараметрыЗапроса.Вставить("IBLOCK_ID","89");
	ПараметрыЗапроса.Вставить("ELEMENT_CODE",КодЭлементаПроцесса);
	ПараметрыЗапроса.Вставить("FIELDS",СтруктураПараметров);
    
    Возврат ВыполнитьПроизвольныйЗапрос("lists.element.add", ПараметрыЗапроса, ВернутьСтрокойJSON);
    
КонецФункции

Функция ДобавитьНовыйЭлементСписка(ИДТипаБлока, ИДБлока, КодЭлементаПроцесса, СтруктураПараметров, ВернутьСтрокойJSON=Ложь) Экспорт
	
	ПараметрыЗапроса = Новый Структура; 
	ПараметрыЗапроса.Вставить("IBLOCK_TYPE_ID", ИДТипаБлока);
	ПараметрыЗапроса.Вставить("IBLOCK_ID", ИДБлока);
	ПараметрыЗапроса.Вставить("ELEMENT_CODE", КодЭлементаПроцесса);
	ПараметрыЗапроса.Вставить("FIELDS", СтруктураПараметров);
	
	Возврат ВыполнитьПроизвольныйЗапрос("lists.element.add", ПараметрыЗапроса, ВернутьСтрокойJSON);

КонецФункции  

функция ИзменитьЭлементСписка(ИДТипаБлока, ИДБлока, КодЭлементаПроцесса, СтруктураПараметров, ВернутьСтрокойJSON = Ложь)   Экспорт
	
    ПараметрыЗапроса = Новый Структура; 
	ПараметрыЗапроса.Вставить("IBLOCK_TYPE_ID", ИДТипаБлока);
	ПараметрыЗапроса.Вставить("IBLOCK_ID", ИДБлока);
	ПараметрыЗапроса.Вставить("ELEMENT_CODE", КодЭлементаПроцесса);
	ПараметрыЗапроса.Вставить("FIELDS", СтруктураПараметров);
	
	Возврат АльтерраВзаимодействиеСБитрикс24.ВыполнитьПроизвольныйЗапрос("lists.element.update", ПараметрыЗапроса, ВернутьСтрокойJSON);

КонецФункции    

Функция ДобавитьНовоеСобытиеКалендаря (СтруктураПараметров, ВернутьСтрокойJSON=Ложь) Экспорт
	
	ПараметрыЗапроса = Новый Структура; 
	ПараметрыЗапроса.Вставить("type", СтруктураПараметров.ТипКалендаря);
	ПараметрыЗапроса.Вставить("ownerId",СтруктураПараметров.ИДВладельцаКалендаря);                            
	ПараметрыЗапроса.Вставить("from", СтруктураПараметров.ДатаНачала);
	ПараметрыЗапроса.Вставить("to", СтруктураПараметров.ДатаОкончания);
	ПараметрыЗапроса.Вставить("section",СтруктураПараметров.ИДКалендаря );
    ПараметрыЗапроса.Вставить("name",СтруктураПараметров.НазваниеСобытия);
	ПараметрыЗапроса.Вставить("description", СтруктураПараметров.ОписаниеСобытия);
	ПараметрыЗапроса.Вставить("is_meeting",СтруктураПараметров.ПризнакВстречиСУчастниками );
	
	СтруктураНапоминания = Новый Структура("type,count","min",15 );
	ПараметрыЗапроса.Вставить("remind",СтруктураНапоминания);
	
	Если СтруктураПараметров.ПризнакВстречиСУчастниками = "Y" Тогда
			ПараметрыЗапроса.Вставить("attendees",СтруктураПараметров.СписокУчастников);
	КонецЕсли;

	Возврат АльтерраВзаимодействиеСБитрикс24.ВыполнитьПроизвольныйЗапрос("calendar.event.add", ПараметрыЗапроса, ВернутьСтрокойJSON);
	
КонецФункции  

#КонецОбласти

#КонецОбласти

#Область ВспомогательныеФункции
Функция СериализоватьВJSON(ПараметрыЗапроса)
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, ,Истина));
    ЗаписатьJSON(ЗаписьJSON, ПараметрыЗапроса);
    ПараметрыJSON = ЗаписьJSON.Закрыть();
    Возврат ПараметрыJSON;
КонецФункции

Функция ДесериализоватьИзJSON(СтрокаJSON)
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);   
	Результат = Неопределено;
	Результат = ПрочитатьJSON(ЧтениеJSON);	
	ЧтениеJSON.Закрыть();
	
    Возврат Результат;
КонецФункции

Функция ДесериализоватьИзJSONВСоответсвие(СтрокаJSON)
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);   
	Результат = Неопределено;
	Результат = ПрочитатьJSON(ЧтениеJSON, Истина);	
	ЧтениеJSON.Закрыть();
	
    Возврат Результат;
КонецФункции

Функция ПолучитьРезультатСтрокой(РезультатЗапроса)
	СтрРезультат = "";
	Если ТипЗнч(РезультатЗапроса)<>Тип("Строка")  и РезультатЗапроса<>Неопределено Тогда
		Если РезультатЗапроса.Свойство("result") Тогда
			Если ТипЗнч(РезультатЗапроса.result)<>Тип("Число") Тогда
				Для каждого Стр Из  РезультатЗапроса.result Цикл
					СтрРезультат = СтрРезультат + ЗначениеВСтрокуВнутр(Стр) + Символы.ПС;
				КонецЦикла;
				Возврат СтрРезультат;
			Иначе
				Возврат РезультатЗапроса;
			КонецЕсли;
		Иначе
			//результат пришёл ошибкой
			СообщениеОбОшибке = "Ошибка "+ Строка(РезультатЗапроса.КодСостояния) +": " + Строка(РезультатЗапроса.НазваниеОшибки) + " - " + Строка(РезультатЗапроса.ОписаниеОшибки);
			Возврат  СообщениеОбОшибке;
		КонецЕсли;
	Иначе
		Возврат РезультатЗапроса;
	КонецЕсли;
КонецФункции

Функция СформироватьКодЭлементаПроцесса(Клиент)
	ТекущаяДата = ФорматироватьДату(ТекущаяДата());
	КодЭлементаПроцесса = Строка(Клиент.Код)+"_"+ТекущаяДата;
	
	Возврат КодЭлементаПроцесса;
КонецФункции

Процедура ЗаписатьВЖурналРегистрации(ТекстОшибки)
	ЗаписьЖурналаРегистрации("Отправка запроса в Б24", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
КонецПроцедуры

Функция ПолучитьКодПодразделения(Подразделение)
	КодВозврата = "";
	
	Наименование = Подразделение.Наименование;
	
	Если Наименование = "Центральный офис" тогда 
		КодВозврата = "856";
	КонецЕсли;
	
	Если Наименование = "Филиал Барнаул" тогда 
		КодВозврата = "857";
	КонецЕсли;
	
	Если Наименование = "Филиал Бийск" тогда 
		КодВозврата = "859";
	КонецЕсли;
	
	Если Наименование = "Филиал Выбор" тогда 
		КодВозврата = "858";
	КонецЕсли;
		
	Возврат КодВозврата;
КонецФункции

Функция ФорматироватьДату(Дата)
	ФорматированнаяДата = "";
	ФорматированнаяДата = Строка(Дата);
	
    ФорматированнаяДата = СтрЗаменить(ФорматированнаяДата,".","");
	ФорматированнаяДата = СтрЗаменить(ФорматированнаяДата,":","");
	ФорматированнаяДата = СтрЗаменить(ФорматированнаяДата," ","");

	Возврат ФорматированнаяДата;
КонецФункции

#КонецОбласти

#Область ПолучениеДанных1С
//СтрИД получается в формате: user_345, где 345 - ид пользователя в битриксе, user_ - префикс
Функция ПолучитьПользователяПоИд(СтрИд) Экспорт
	Пользователь = Неопределено;
	Ид = Прав(СтрИд, СтрДлина(СтрИд)-5);

	НазванияПолей = Новый Структура;
	НазванияПолей.Вставить("LAST_NAME");
	НазванияПолей.Вставить("NAME");
	НазванияПолей.Вставить("SECOND_NAME");
	
	ДанныеПользователя = ПолучитьЗначениеПоляСущностиПоID("user", Ид, НазванияПолей);
	ФИОПользователя = ДанныеПользователя["LAST_NAME"] + " " + ДанныеПользователя["NAME"] + " " + ДанныеПользователя["SECOND_NAME"];
	Пользователь = НайтиПользователей1СПоНаименованию(ФИОПользователя);
	Если Пользователь.Количество()>0 Тогда
		Пользователь = Пользователь[0];
	Иначе
		Пользователь = Неопределено;
	КонецЕсли;
	
	Возврат Пользователь;
КонецФункции

Функция НайтиПользователей1СПоНаименованию(ФИОПользователей)  Экспорт
	МассивФИОПользователей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ФИОПользователей, ",",,Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ПометкаУдаления = ЛОЖЬ
		|	И Пользователи.ФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|	И Пользователи.Наименование В(&Наименования)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Пользователи.Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ПометкаУдаления = ЛОЖЬ
		|	И Пользователи.ФизическоеЛицо.Наименование В(&Наименования)";
	
	Запрос.УстановитьПараметр("Наименования", МассивФИОПользователей);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивПользователей = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		МассивПользователей.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	Возврат МассивПользователей;
КонецФункции

Процедура ЗаписатьРезультатВФайл(ТекстСтрока,ТекстФайл)
	
	ПутьФайла = "\\TG-Storage01\Alterra - общая\Харина М.А\тест";
	ТекстЗаписиВСтроке = "";
	ТекстЗаписиВФайле = "";
	
	Если Не ПустаяСтрока(ТекстФайл) Тогда
	Попытка
		ФайлПолученный = Новый ЧтениеТекста(ТекстФайл);
		ТекстЗаписиВФайле = ФайлПолученный.Прочитать();
		ФайлПолученный.Закрыть();
	Исключение
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Чтение файла'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстСтрока) Тогда
		ТекстЗаписиВСтроке = ТекстСтрока;
	КонецЕсли;
	
	Если (Не ПустаяСтрока(ТекстЗаписиВСтроке) ИЛИ Не ПустаяСтрока(ТекстЗаписиВФайле)) И Не ПустаяСтрока(ПутьФайла) Тогда
		Попытка	
			ЗначениеТекущегоПользователя = ПараметрыСеанса.ТекущийПользователь.Наименование;
			Файл = Новый ЗаписьТекста(ПутьФайла+Строка(Формат(ТекущаяДата(), "ДФ=""дд ММММ гггг 'г.' ЧЧ мм сс"""))+" ("+ЗначениеТекущегоПользователя+")"+".txt");
			Файл.ЗаписатьСтроку("Запрос:");
			Файл.ЗаписатьСтроку(ТекстЗаписиВСтроке);
			Файл.ЗаписатьСтроку("Ответ:");
			Файл.ЗаписатьСтроку(ТекстЗаписиВФайле);
			Файл.Закрыть();
		Исключение
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Запись в Файл (строки или файла)'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

Функция ПолучитьФайлИзКорневогоХранилища(ИДФайла) Экспорт
	АдресСервера = "bitrix.tg-alterra.ru/";
	HTTPСоединение = Новый HTTPСоединение(АдресСервера, , , , , , Новый ЗащищенноеСоединениеOpenSSL);	
	
	ВебХук=Константы.ВебХук.Получить();
	
	АдресРесурса = "local/api/v1/file.get?access_token=" + ВебХук + "&id="+Строка(ИДФайла);
                             
	Заголовки = Новый Соответствие;
    Заголовки.Вставить("Accept-Language", "ru");
    Заголовки.Вставить("Accept-Charset", "utf-8");
    Заголовки.Вставить("Content-Language", "ru");
    Заголовки.Вставить("Content-Charset", "utf-8");
    Заголовки.Вставить("Content-type", "application/json"); 
    
    HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);

    HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
    ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
    Возврат ДесериализоватьИзJSON(ТелоОтвета);
КонецФункции
